; domain
(define (domain health-care)
    (:requirements :adl)

    (:types
        medical-unit box content robot patient - locatable
        robot-box robot-patient - robot
        location 
        carrier 
        capacity-num - object
    )

    (:predicates
        ; location predicates
        (at ?o - locatable ?l - location)
        (connected ?l1 - location ?l2 - location)
        (is-central_warehouse ?l - location)
        ; box predicates
        (empty ?b - box)
        (box-has-content ?b - box ?c - content)
        ; content predicates
        (content-available ?c - content ?l - location)
        (unit-needs-content ?u - medical-unit ?c - content)
        (unit-has-content ?u - medical-unit ?c - content)
        ; patient predicates
        (patient-needs-unit ?p - patient ?u - medical-unit)
        (patient-at-unit ?p - patient ?u - medical-unit)
        ; robot-box with CARRIER predicates
        (robot-has-carrier ?r - robot ?cr - carrier)
        (box-in-carrier ?b - box ?cr - carrier)
        ; carrier capacity predicates
        (carrier-has-capacity ?cr - carrier ?n - capacity-num) ; that's the maximum capacity of the carrier
        (next-capacity ?n1 - capacity-num ?n2 - capacity-num)
        (carrier-current-capacity ?cr - carrier ?n - capacity-num)
        (carrier-pending-box ?cr - carrier ?b - box) ; useful to avoid the carrier to return to the central_warehouse if there are still boxes to deliver (so there are non empty boxes in the carrier)
        ; robot-patient predicates
        (robot-has-patient ?r - robot-patient ?p - patient)
    )

    (:action load-box-carrier
        :parameters (?r - robot-box ?b - box ?c - carrier ?l - location ?current ?next ?max - capacity-num)
        :precondition (and
            ; box and robot are at the same location
            (at ?r ?l)
            (at ?b ?l)
            ; robot has that carrier
            (robot-has-carrier ?r ?c)

            (carrier-current-capacity ?c ?current)
            (next-capacity ?current ?next)
            (carrier-has-capacity ?c ?max) 

            ; check that carrier is not already full
            (not (next-capacity ?current ?max)) ; if the current capacity is the maximum, then the carrier is full => no more boxes can be             
        )
        :effect (and
            (box-in-carrier ?b ?c)
            (not (carrier-current-capacity ?c ?current))
            (carrier-current-capacity ?c ?next)
        )
    )

    (:action fill-box
        ; A box can be filled in two scenarios:
            ; 1. When the box is not loaded in any carrier (normal fill-then-load pattern)
            ; 2. When the box is loaded in this specific robot's carrier (allowing box reuse pattern)
        ; This enables both the preferred pattern of filling before loading, while also allowing robots to reuse boxes after delivery by loading them empty and then filling.
        :parameters (?r - robot-box ?cr - carrier ?b - box ?c - content ?l - location)
        :precondition (and
            ; robot and box are at the same location
            (robot-has-carrier ?r ?cr)
            (at ?r ?l)
            (at ?b ?l)
            ; box is empty
            (empty ?b)
            ; content is available at the location
            (content-available ?c ?l)

            (or 
                ; either the box is not in any carrier
                (not (exists (?c2 - carrier) (box-in-carrier ?b ?c2)))
                ; or the box is specifically in this robot's carrier
                (box-in-carrier ?b ?cr)
            )
            
            (not (carrier-pending-box ?cr ?b))
        )
        :effect (and
            (not (empty ?b))
            (box-has-content ?b ?c)
            (not (content-available ?c ?l)) ; basically this means that the content is no longer available at the central_warehouse 

            (carrier-pending-box ?cr ?b) ; update is here because the box is not empty anymore
        )
    )

    (:action move-robot-box
        :parameters (?r - robot-box ?cr - carrier ?from - location ?to - location)
        :precondition (and
            (at ?r ?from)
            (connected ?from ?to)
            (not (= ?from ?to))
            (robot-has-carrier ?r ?cr)

            ; robot does not have to return to the central_warehouse until all boxes on the carrier have been delivered
            (or
                ; if the robot is not at the central_warehouse, then it can move to any location
                (not (is-central_warehouse ?to)) 
                ; if the robot is at the central_warehouse, then it can move to any location if it is not carrying any box (i.e., either the carrier is empty or all boxes in the carrier are empty)
                (and 
                    (is-central_warehouse ?to)
                    (not (exists (?b - box) (carrier-pending-box ?cr ?b)
                    ))
                )
            )
        )
        :effect (and
            (at ?r ?to)
            (not (at ?r ?from))
            ; Move box if robot is carrying in its carrier
            (forall
                (?b - box)
                (when
                    (box-in-carrier ?b ?cr)
                    (and
                        (at ?b ?to)
                        (not (at ?b ?from))
                    )
                )
            )
        )
    )

    (:action deliver-content
        :parameters (?r - robot-box ?cr - carrier ?b - box ?u - medical-unit ?c - content ?l - location ?current ?prev - capacity-num)
        :precondition (and
            (at ?r ?l)
            (at ?u ?l)
            (robot-has-carrier ?r ?cr)
            (box-in-carrier ?b ?cr)
            (box-has-content ?b ?c)
            (unit-needs-content ?u ?c) ; the predicate "unit-needs-content" is an extra check to avoid delivering content to a unit that does not need it, so to avoid extra moves
            (carrier-current-capacity ?cr ?current)
            (next-capacity ?prev ?current)
            (not (empty ?b))
        )
        :effect (and
            (unit-has-content ?u ?c)
            (not (unit-needs-content ?u ?c))
            (not (box-has-content ?b ?c))
            (not (box-in-carrier ?b ?cr)) ; the box is no longer in the carrier
            (not (carrier-pending-box ?cr ?b)) ; the box has been delivered
            (empty ?b)
            (at ?b ?l) ; box is empty and at the location (can be reused)
            ; update carrier load
            (not (carrier-current-capacity ?cr ?current))
            (carrier-current-capacity ?cr ?prev)
        )
    )

    (:action pick-up-patient
        :parameters (?r - robot-patient ?p - patient ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)
            ; check that the robot is not already loaded with another patient => here a robot can carry only one patient at a time ; CHECK
            ; (can be also done with a predicate ad hot as "can-carry-patient")
            (not (exists
                    (?p2 - patient)
                    (robot-has-patient ?r ?p2)))

            ; check that the patient is not already loaded with a robot ; CHECK
            (not (exists
                    (?r2 - robot-patient)
                    (robot-has-patient ?r2 ?p)))
        )
        :effect (and
            (robot-has-patient ?r ?p)
        )
    )

    (:action move-robot-patient
        :parameters (?r - robot-patient ?from - location ?to - location)
        :precondition (and
            (at ?r ?from)
            (connected ?from ?to)
        )
        :effect (and
            (at ?r ?to)
            (not (at ?r ?from))
            ; Move patient if robot is carrying one
            (forall
                (?p - patient)
                (when
                    (robot-has-patient ?r ?p)
                    (and
                        (at ?p ?to)
                        (not (at ?p ?from))
                    )
                )
            )
        )
    )

    (:action deliver-patient
        :parameters (?r - robot-patient ?p - patient ?u - medical-unit ?l - location)
        :precondition (and
            (at ?r ?l)
            (at ?p ?l)
            (at ?u ?l)
            (patient-needs-unit ?p ?u)
            (robot-has-patient ?r ?p)
        )
        :effect (and
            (patient-at-unit ?p ?u)
            (not (patient-needs-unit ?p ?u))
            (not (robot-has-patient ?r ?p))
        )
    )
)

; problem
(define (problem p2-health-care)
    (:domain health-care)
    (:objects
        box1 box2 box3 box4 - box
        robot-box1 robot-box2 - robot-box
        robot-patient1 - robot-patient
        
        central_warehouse entrance
        area1 area2 area3 emergency_area
        corridor1 corridor2
        - location
        
        MedicalUnit1 MedicalUnit2a MedicalUnit2b MedicalUnit3 EmergencyUnit - medical-unit
        scalpel aspirine tongue bandage antibiotic tank - content
        patient1 patient2 patient3 patient4 - patient

        capacity0 capacity1 capacity2 capacity3 capacity4 - capacity-num
        carrier1 carrier2 - carrier
    )

    (:init
        ; Locations
        (connected central_warehouse corridor1)
        (connected corridor1 central_warehouse)
        (connected corridor1 area1)
        (connected area1 corridor1)
        (connected area1 area2)
        (connected area2 area1)
        (connected corridor1 area3)
        (connected area3 corridor1)
        (connected corridor2 corridor1)
        (connected corridor1 corridor2)
        (connected corridor2 emergency_area)
        (connected entrance corridor2)
        (connected corridor2 entrance)

        (is-central_warehouse central_warehouse)

        ; Initial positions
        (at box1 central_warehouse)
        (at box2 central_warehouse)
        (at box3 central_warehouse)
        (at box4 central_warehouse)

        (content-available scalpel central_warehouse)
        (content-available aspirine central_warehouse)
        (content-available tongue central_warehouse)
        (content-available bandage central_warehouse)
        (content-available antibiotic central_warehouse)
        (content-available tank central_warehouse)

        (at MedicalUnit1 area1)
        (at MedicalUnit2a area2)
        (at MedicalUnit2b area2)
        (at MedicalUnit3 area3)
        (at EmergencyUnit emergency_area)

        (at robot-box1 central_warehouse)
        (at robot-box2 central_warehouse)

        (at robot-patient1 entrance)

        (at patient1 entrance)
        (at patient2 entrance)
        (at patient3 corridor1)
        (at patient4 corridor2)
        
        ; Initial states
        (empty box1)
        (empty box2)
        (empty box3)
        (empty box4)
        
        ; Carriers 
        (next-capacity capacity0 capacity1)
        (next-capacity capacity1 capacity2)
        (next-capacity capacity2 capacity3)
        (next-capacity capacity3 capacity4)

        ; carrier1 can carry 3 boxes and is empty
        (carrier-has-capacity carrier1 capacity4) 
        (carrier-current-capacity carrier1 capacity0) 
        ; carrier2 can carry 2 box and has 1 box
        (carrier-has-capacity carrier2 capacity3) 
        (carrier-current-capacity carrier2 capacity1)

        (robot-has-carrier robot-box1 carrier1)
        (robot-has-carrier robot-box2 carrier2)    

        ; Units needs
        (unit-needs-content MedicalUnit1 scalpel)
        (unit-needs-content MedicalUnit1 aspirine)
        (unit-needs-content MedicalUnit2a antibiotic)
        (unit-needs-content MedicalUnit2b tank)
        (unit-needs-content MedicalUnit3 tongue)
        (unit-needs-content EmergencyUnit bandage)
        
        ; Patients needs
        (patient-needs-unit patient1 MedicalUnit1)
        (patient-needs-unit patient2 MedicalUnit2b)
        (patient-needs-unit patient3 MedicalUnit3)
        (patient-needs-unit patient4 EmergencyUnit)
    )

    (:goal
        (and
            (unit-has-content MedicalUnit1 scalpel)
            (unit-has-content MedicalUnit1 aspirine)
            (unit-has-content MedicalUnit2a antibiotic)
            (unit-has-content MedicalUnit2b tank)
            (unit-has-content MedicalUnit3 tongue)
            (unit-has-content EmergencyUnit bandage)
            
            (patient-at-unit patient1 MedicalUnit1)
            (patient-at-unit patient2 MedicalUnit2b)
            (patient-at-unit patient3 MedicalUnit3)
            (patient-at-unit patient4 EmergencyUnit)
        )
    )
)

; plan
1. (fill-box robot-box1 carrier1 box1 antibiotic central_warehouse)
   deleted: (empty box1) (content-available antibiotic central_warehouse)
   added: (box-has-content box1 antibiotic) (carrier-pending-box carrier1 box1)
   goals met: 0 of 10
2. (fill-box robot-box1 carrier1 box2 aspirine central_warehouse)
   deleted: (empty box2) (content-available aspirine central_warehouse)
   added: (box-has-content box2 aspirine) (carrier-pending-box carrier1 box2)
   goals met: 0 of 10
3. (fill-box robot-box1 carrier1 box3 bandage central_warehouse)
   deleted: (empty box3) (content-available bandage central_warehouse)
   added: (box-has-content box3 bandage) (carrier-pending-box carrier1 box3)
   goals met: 0 of 10
4. (fill-box robot-box1 carrier1 box4 scalpel central_warehouse)
   deleted: (empty box4) (content-available scalpel central_warehouse)
   added: (box-has-content box4 scalpel) (carrier-pending-box carrier1 box4)
   goals met: 0 of 10
5. (move-robot-box robot-box2 carrier2 central_warehouse corridor1)
   deleted: (at robot-box2 central_warehouse)
   added: (at robot-box2 corridor1)
   goals met: 0 of 10
6. (move-robot-box robot-box2 carrier2 corridor1 area1)
   deleted: (at robot-box2 corridor1)
   added: (at robot-box2 area1)
   goals met: 0 of 10
7. (load-box-carrier robot-box1 box1 carrier1 central_warehouse capacity0 capacity1 capacity4)
   deleted: (carrier-current-capacity carrier1 capacity0)
   added: (box-in-carrier box1 carrier1) (carrier-current-capacity carrier1 capacity1)
   goals met: 0 of 10
8. (load-box-carrier robot-box1 box2 carrier1 central_warehouse capacity1 capacity2 capacity4)
   deleted: (carrier-current-capacity carrier1 capacity1)
   added: (box-in-carrier box2 carrier1) (carrier-current-capacity carrier1 capacity2)
   goals met: 0 of 10
9. (pick-up-patient robot-patient1 patient1 entrance)
   added: (robot-has-patient robot-patient1 patient1)
   goals met: 0 of 10
10. (move-robot-patient robot-patient1 entrance corridor2)
   deleted: (at robot-patient1 entrance) (at patient1 entrance)
   added: (at robot-patient1 corridor2) (at patient1 corridor2)
   goals met: 0 of 10
11. (move-robot-patient robot-patient1 corridor2 corridor1)
   deleted: (at robot-patient1 corridor2) (at patient1 corridor2)
   added: (at robot-patient1 corridor1) (at patient1 corridor1)
   goals met: 0 of 10
12. (move-robot-patient robot-patient1 corridor1 area1)
   deleted: (at robot-patient1 corridor1) (at patient1 corridor1)
   added: (at robot-patient1 area1) (at patient1 area1)
   goals met: 0 of 10
13. (deliver-patient robot-patient1 patient1 medicalunit1 area1)
   deleted: (patient-needs-unit patient1 medicalunit1) (robot-has-patient robot-patient1 patient1)
   added: (patient-at-unit patient1 medicalunit1)
   goals met: 1 of 10
14. (move-robot-patient robot-patient1 area1 corridor1)
   deleted: (at robot-patient1 area1)
   added: (at robot-patient1 corridor1)
   goals met: 1 of 10
15. (pick-up-patient robot-patient1 patient3 corridor1)
   added: (robot-has-patient robot-patient1 patient3)
   goals met: 1 of 10
16. (move-robot-patient robot-patient1 corridor1 area3)
   deleted: (at robot-patient1 corridor1) (at patient3 corridor1)
   added: (at robot-patient1 area3) (at patient3 area3)
   goals met: 1 of 10
17. (deliver-patient robot-patient1 patient3 medicalunit3 area3)
   deleted: (patient-needs-unit patient3 medicalunit3) (robot-has-patient robot-patient1 patient3)
   added: (patient-at-unit patient3 medicalunit3)
   goals met: 2 of 10
18. (move-robot-patient robot-patient1 area3 corridor1)
   deleted: (at robot-patient1 area3)
   added: (at robot-patient1 corridor1)
   goals met: 2 of 10
19. (move-robot-patient robot-patient1 corridor1 corridor2)
   deleted: (at robot-patient1 corridor1)
   added: (at robot-patient1 corridor2)
   goals met: 2 of 10
20. (move-robot-patient robot-patient1 corridor2 entrance)
   deleted: (at robot-patient1 corridor2)
   added: (at robot-patient1 entrance)
   goals met: 2 of 10
21. (pick-up-patient robot-patient1 patient2 entrance)
   added: (robot-has-patient robot-patient1 patient2)
   goals met: 2 of 10
22. (move-robot-patient robot-patient1 entrance corridor2)
   deleted: (at robot-patient1 entrance) (at patient2 entrance)
   added: (at robot-patient1 corridor2) (at patient2 corridor2)
   goals met: 2 of 10
23. (move-robot-patient robot-patient1 corridor2 corridor1)
   deleted: (at robot-patient1 corridor2) (at patient2 corridor2)
   added: (at robot-patient1 corridor1) (at patient2 corridor1)
   goals met: 2 of 10
24. (move-robot-patient robot-patient1 corridor1 area1)
   deleted: (at robot-patient1 corridor1) (at patient2 corridor1)
   added: (at robot-patient1 area1) (at patient2 area1)
   goals met: 2 of 10
25. (move-robot-patient robot-patient1 area1 area2)
   deleted: (at robot-patient1 area1) (at patient2 area1)
   added: (at robot-patient1 area2) (at patient2 area2)
   goals met: 2 of 10
26. (deliver-patient robot-patient1 patient2 medicalunit2b area2)
   deleted: (patient-needs-unit patient2 medicalunit2b) (robot-has-patient robot-patient1 patient2)
   added: (patient-at-unit patient2 medicalunit2b)
   goals met: 3 of 10
27. (move-robot-patient robot-patient1 area2 area1)
   deleted: (at robot-patient1 area2)
   added: (at robot-patient1 area1)
   goals met: 3 of 10
28. (move-robot-patient robot-patient1 area1 corridor1)
   deleted: (at robot-patient1 area1)
   added: (at robot-patient1 corridor1)
   goals met: 3 of 10
29. (move-robot-patient robot-patient1 corridor1 corridor2)
   deleted: (at robot-patient1 corridor1)
   added: (at robot-patient1 corridor2)
   goals met: 3 of 10
30. (pick-up-patient robot-patient1 patient4 corridor2)
   added: (robot-has-patient robot-patient1 patient4)
   goals met: 3 of 10
31. (move-robot-patient robot-patient1 corridor2 emergency_area)
   deleted: (at robot-patient1 corridor2) (at patient4 corridor2)
   added: (at robot-patient1 emergency_area) (at patient4 emergency_area)
   goals met: 3 of 10
32. (deliver-patient robot-patient1 patient4 emergencyunit emergency_area)
   deleted: (patient-needs-unit patient4 emergencyunit) (robot-has-patient robot-patient1 patient4)
   added: (patient-at-unit patient4 emergencyunit)
   goals met: 4 of 10
33. (move-robot-box robot-box1 carrier1 central_warehouse corridor1)
   deleted: (at robot-box1 central_warehouse) (at box1 central_warehouse) (at box2 central_warehouse)
   added: (at robot-box1 corridor1) (at box1 corridor1) (at box2 corridor1)
   goals met: 4 of 10
34. (move-robot-box robot-box2 carrier2 area1 area2)
   deleted: (at robot-box2 area1)
   added: (at robot-box2 area2)
   goals met: 4 of 10
35. (move-robot-box robot-box1 carrier1 corridor1 area1)
   deleted: (at robot-box1 corridor1) (at box1 corridor1) (at box2 corridor1)
   added: (at robot-box1 area1) (at box1 area1) (at box2 area1)
   goals met: 4 of 10
36. (deliver-content robot-box1 carrier1 box2 medicalunit1 aspirine area1 capacity2 capacity1)
   deleted: (unit-needs-content medicalunit1 aspirine) (box-has-content box2 aspirine) (box-in-carrier box2 carrier1) (carrier-pending-box carrier1 box2) (carrier-current-capacity carrier1 capacity2)
   added: (unit-has-content medicalunit1 aspirine) (empty box2) (carrier-current-capacity carrier1 capacity1)
   goals met: 5 of 10
37. (move-robot-box robot-box2 carrier2 area2 area1)
   deleted: (at robot-box2 area2)
   added: (at robot-box2 area1)
   goals met: 5 of 10
38. (move-robot-box robot-box1 carrier1 area1 area2)
   deleted: (at robot-box1 area1) (at box1 area1)
   added: (at robot-box1 area2) (at box1 area2)
   goals met: 5 of 10
39. (deliver-content robot-box1 carrier1 box1 medicalunit2a antibiotic area2 capacity1 capacity0)
   deleted: (unit-needs-content medicalunit2a antibiotic) (box-has-content box1 antibiotic) (box-in-carrier box1 carrier1) (carrier-pending-box carrier1 box1) (carrier-current-capacity carrier1 capacity1)
   added: (unit-has-content medicalunit2a antibiotic) (empty box1) (carrier-current-capacity carrier1 capacity0)
   goals met: 6 of 10
40. (load-box-carrier robot-box2 box2 carrier2 area1 capacity1 capacity2 capacity3)
   deleted: (carrier-current-capacity carrier2 capacity1)
   added: (box-in-carrier box2 carrier2) (carrier-current-capacity carrier2 capacity2)
   goals met: 6 of 10
41. (move-robot-box robot-box2 carrier2 area1 corridor1)
   deleted: (at robot-box2 area1) (at box2 area1)
   added: (at robot-box2 corridor1) (at box2 corridor1)
   goals met: 6 of 10
42. (move-robot-box robot-box2 carrier2 corridor1 central_warehouse)
   deleted: (at robot-box2 corridor1) (at box2 corridor1)
   added: (at robot-box2 central_warehouse) (at box2 central_warehouse)
   goals met: 6 of 10
43. (fill-box robot-box2 carrier2 box2 tank central_warehouse)
   deleted: (empty box2) (content-available tank central_warehouse)
   added: (box-has-content box2 tank) (carrier-pending-box carrier2 box2)
   goals met: 6 of 10
44. (move-robot-box robot-box2 carrier2 central_warehouse corridor1)
   deleted: (at robot-box2 central_warehouse) (at box2 central_warehouse)
   added: (at robot-box2 corridor1) (at box2 corridor1)
   goals met: 6 of 10
45. (move-robot-box robot-box2 carrier2 corridor1 area1)
   deleted: (at robot-box2 corridor1) (at box2 corridor1)
   added: (at robot-box2 area1) (at box2 area1)
   goals met: 6 of 10
46. (move-robot-box robot-box2 carrier2 area1 area2)
   deleted: (at robot-box2 area1) (at box2 area1)
   added: (at robot-box2 area2) (at box2 area2)
   goals met: 6 of 10
47. (deliver-content robot-box2 carrier2 box2 medicalunit2b tank area2 capacity2 capacity1)
   deleted: (unit-needs-content medicalunit2b tank) (box-has-content box2 tank) (box-in-carrier box2 carrier2) (carrier-pending-box carrier2 box2) (carrier-current-capacity carrier2 capacity2)
   added: (unit-has-content medicalunit2b tank) (empty box2) (carrier-current-capacity carrier2 capacity1)
   goals met: 7 of 10
48. (move-robot-box robot-box2 carrier2 area2 area1)
   deleted: (at robot-box2 area2)
   added: (at robot-box2 area1)
   goals met: 7 of 10
49. (move-robot-box robot-box2 carrier2 area1 corridor1)
   deleted: (at robot-box2 area1)
   added: (at robot-box2 corridor1)
   goals met: 7 of 10
50. (move-robot-box robot-box2 carrier2 corridor1 central_warehouse)
   deleted: (at robot-box2 corridor1)
   added: (at robot-box2 central_warehouse)
   goals met: 7 of 10
51. (load-box-carrier robot-box2 box4 carrier2 central_warehouse capacity1 capacity2 capacity3)
   deleted: (carrier-current-capacity carrier2 capacity1)
   added: (box-in-carrier box4 carrier2) (carrier-current-capacity carrier2 capacity2)
   goals met: 7 of 10
52. (move-robot-box robot-box2 carrier2 central_warehouse corridor1)
   deleted: (at robot-box2 central_warehouse) (at box4 central_warehouse)
   added: (at robot-box2 corridor1) (at box4 corridor1)
   goals met: 7 of 10
53. (move-robot-box robot-box2 carrier2 corridor1 area1)
   deleted: (at robot-box2 corridor1) (at box4 corridor1)
   added: (at robot-box2 area1) (at box4 area1)
   goals met: 7 of 10
54. (deliver-content robot-box2 carrier2 box4 medicalunit1 scalpel area1 capacity2 capacity1)
   deleted: (unit-needs-content medicalunit1 scalpel) (box-has-content box4 scalpel) (box-in-carrier box4 carrier2) (carrier-current-capacity carrier2 capacity2)
   added: (unit-has-content medicalunit1 scalpel) (empty box4) (carrier-current-capacity carrier2 capacity1)
   goals met: 8 of 10
55. (load-box-carrier robot-box2 box4 carrier2 area1 capacity1 capacity2 capacity3)
   deleted: (carrier-current-capacity carrier2 capacity1)
   added: (box-in-carrier box4 carrier2) (carrier-current-capacity carrier2 capacity2)
   goals met: 8 of 10
56. (move-robot-box robot-box2 carrier2 area1 corridor1)
   deleted: (at robot-box2 area1) (at box4 area1)
   added: (at robot-box2 corridor1) (at box4 corridor1)
   goals met: 8 of 10
57. (move-robot-box robot-box2 carrier2 corridor1 central_warehouse)
   deleted: (at robot-box2 corridor1) (at box4 corridor1)
   added: (at robot-box2 central_warehouse) (at box4 central_warehouse)
   goals met: 8 of 10
58. (fill-box robot-box2 carrier2 box4 tongue central_warehouse)
   deleted: (empty box4) (content-available tongue central_warehouse)
   added: (box-has-content box4 tongue) (carrier-pending-box carrier2 box4)
   goals met: 8 of 10
59. (move-robot-box robot-box2 carrier2 central_warehouse corridor1)
   deleted: (at robot-box2 central_warehouse) (at box4 central_warehouse)
   added: (at robot-box2 corridor1) (at box4 corridor1)
   goals met: 8 of 10
60. (move-robot-box robot-box2 carrier2 corridor1 area3)
   deleted: (at robot-box2 corridor1) (at box4 corridor1)
   added: (at robot-box2 area3) (at box4 area3)
   goals met: 8 of 10
61. (deliver-content robot-box2 carrier2 box4 medicalunit3 tongue area3 capacity2 capacity1)
   deleted: (unit-needs-content medicalunit3 tongue) (box-has-content box4 tongue) (box-in-carrier box4 carrier2) (carrier-pending-box carrier2 box4) (carrier-current-capacity carrier2 capacity2)
   added: (unit-has-content medicalunit3 tongue) (empty box4) (carrier-current-capacity carrier2 capacity1)
   goals met: 9 of 10
62. (move-robot-box robot-box2 carrier2 area3 corridor1)
   deleted: (at robot-box2 area3)
   added: (at robot-box2 corridor1)
   goals met: 9 of 10
63. (move-robot-box robot-box2 carrier2 corridor1 central_warehouse)
   deleted: (at robot-box2 corridor1)
   added: (at robot-box2 central_warehouse)
   goals met: 9 of 10
64. (load-box-carrier robot-box2 box3 carrier2 central_warehouse capacity1 capacity2 capacity3)
   deleted: (carrier-current-capacity carrier2 capacity1)
   added: (box-in-carrier box3 carrier2) (carrier-current-capacity carrier2 capacity2)
   goals met: 9 of 10
65. (move-robot-box robot-box2 carrier2 central_warehouse corridor1)
   deleted: (at robot-box2 central_warehouse) (at box3 central_warehouse)
   added: (at robot-box2 corridor1) (at box3 corridor1)
   goals met: 9 of 10
66. (move-robot-box robot-box2 carrier2 corridor1 corridor2)
   deleted: (at robot-box2 corridor1) (at box3 corridor1)
   added: (at robot-box2 corridor2) (at box3 corridor2)
   goals met: 9 of 10
67. (move-robot-box robot-box2 carrier2 corridor2 emergency_area)
   deleted: (at robot-box2 corridor2) (at box3 corridor2)
   added: (at robot-box2 emergency_area) (at box3 emergency_area)
   goals met: 9 of 10
68. (deliver-content robot-box2 carrier2 box3 emergencyunit bandage emergency_area capacity2 capacity1)
   deleted: (unit-needs-content emergencyunit bandage) (box-has-content box3 bandage) (box-in-carrier box3 carrier2) (carrier-current-capacity carrier2 capacity2)
   added: (unit-has-content emergencyunit bandage) (empty box3) (carrier-current-capacity carrier2 capacity1)
   goals met: 10 of 10
